{
  "backend/main.mo": "Main Motoko actor defining all data types (StockPrediction, NewsArticle, MarketCall, DailyStockPick, etc.) and public functions for storing and retrieving predictions, news articles, analyses, market calls, and daily stock picks, with HTTP outcall integration and migration support.",
  "backend/migration.mo": "Motoko migration module that defines OldActor and NewActor state shapes (identical in this version) and exports a no-op `run` function that passes old state through unchanged.",
  "feature_evidence.json": "Feature evidence report listing two high-confidence features: fixing React Query hooks in useQueries.ts for proper loading/error/empty states, and auditing PredictionResultsPage and its child components for null safety and loading skeletons.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering components, pages, hooks, and utilities across the React frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes (colors, radius, chart palette, sidebar) applied via @layer base.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a `#root` div and loading the TypeScript entry point via a module script tag.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with two routes (home and prediction detail), wraps the app in QueryClientProvider with 5-minute stale time, and adds a Sonner toast notification layer.",
  "frontend/src/components/ContributingFactorsSection.tsx": "Card component that displays news sentiment, institutional FII/DII flow, and per-indicator technical scores as normalized progress bars and labeled summary cards derived from a StockPrediction object.",
  "frontend/src/components/DailyMarketCallCard.tsx": "Displays a styled card showing the daily market call (Bullish/Bearish/Moderate) for a symbol, including confidence score, contributing factor scores with progress bars, and a summary rationale.",
  "frontend/src/components/DailyOptionsPicksSection.tsx": "Renders a section of daily options pick cards for stocks, showing trend direction, CE/PE recommendations, call/put actions, and factor badges derived from news sentiment, FII flow, and other signals.",
  "frontend/src/components/FactorBadge.tsx": "Provides a small tooltip-enabled badge component for displaying a named factor (news, FII, global, etc.) with positive/negative/neutral sentiment styling, plus helper functions to map numeric or enum values to sentiment types.",
  "frontend/src/components/FiiDiiChart.tsx": "Renders a Recharts line chart showing FII and DII net flow over the last 30 data points derived from stock predictions.",
  "frontend/src/components/Layout.tsx": "Defines the top-level app layout with a sticky header, router outlet for page content, and a footer with a disclaimer and caffeine.ai attribution link.",
  "frontend/src/components/MarketCallHistoryChart.tsx": "Renders a Recharts composed chart showing the last 30 daily market calls as colored bars (bullish/bearish/moderate) with a confidence score line overlay and a custom tooltip.",
  "frontend/src/components/NewsArticlesList.tsx": "Displays a list of up to 8 news articles with title, source, date, sentiment badge, and optional summary, including skeleton loading states and an empty state message.",
  "frontend/src/components/NewsCategoryTabs.tsx": "Renders a tabbed interface for browsing news articles filtered by category (World Markets, Tariffs, etc.), displaying each article as a card with title, source badge, sentiment badge, date, and summary.",
  "frontend/src/components/NewsSentimentBadge.tsx": "Renders a colored badge indicating positive, negative, or neutral sentiment for a news article.",
  "frontend/src/components/PredictionCard.tsx": "Displays a stock prediction card showing price direction (bullish/bearish/neutral), confidence score, short-term price target range, risk factors, and AI reasoning for a given StockPrediction.",
  "frontend/src/components/StockPriceChart.tsx": "Renders a Recharts line chart showing the historical short-term price target range (low/high) and confidence score across up to 30 past predictions for a given stock symbol.",
  "frontend/src/components/StockSearchBar.tsx": "Provides a stock symbol search input with autocomplete suggestions, input validation, and a submit button that triggers a prediction search.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook, managing AuthClient creation, login/logout flow, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating stock predictions, news articles, market calls, and daily picks from the backend actor, with local data generation as fallback.",
  "frontend/src/hooks/useStockAutocomplete.ts": "Provides a hook for autocompleting NSE stock symbols and names from a hardcoded list of Indian equities across multiple sectors.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining light/dark mode CSS custom properties for a financial market color palette, including bullish/bearish/neutral semantic colors and chart colors.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/HomePage.tsx": "Home page component featuring a hero section with a stock search bar and a today's NIFTY50 market call banner, plus a daily options picks section.",
  "frontend/src/pages/PredictionResultsPage.tsx": "Prediction results page that displays AI stock prediction details, contributing factors, news, FII/DII charts, and market call history for a given stock symbol, with skeleton loading states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (using oklch CSS variables), border radii, fonts, shadows, keyframes, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project state metadata describing a stock analysis app with a known 'failed to load prediction' error, listing existing fix features for React Query hooks and UI components, plus a pending backend Motoko actor audit task."
}