{
  "backend/main.mo": "Main actor defining stock prediction and news article storage with query/update methods for fetching predictions by symbol/ID/time range, storing predictions/articles, and making HTTP outcalls to fetch news from Google News API.",
  "backend/migration.mo": "Migration module that initializes predictionData map with sample stock predictions for 6 major Indian stocks (SBIN, TCS, INFY, HDFC, RELIANCE, ICICIBANK) when upgrading from old actor state to new actor state.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: fixing prediction data retrieval logic and expanding stock autocomplete list to 100+ NSE stocks, with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration files describing their functionality and recent updates for stock prediction UI.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH-based color system for light/dark modes including financial market colors (bullish/bearish/neutral) and component-specific CSS variables.",
  "frontend/index.html": "HTML entry point with root div and module script import for the React application titled 'Stock Market Predictor'.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for homepage (/) and prediction results page (/prediction/$symbol), wrapped in Layout component.",
  "frontend/src/components/ContributingFactorsSection.tsx": "Card component displaying three contributing factors (news sentiment, institutional flow, chart patterns) with progress bars, icons, and color-coded metrics based on bullish/bearish/neutral indicators.",
  "frontend/src/components/FiiDiiChart.tsx": "Recharts line chart component visualizing FII and DII net investment flows over time from the last 30 predictions with tooltips showing buy/sell volumes.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, footer, and outlet for nested routes. Includes branding, navigation link, disclaimer, and caffeine.ai attribution.",
  "frontend/src/components/NewsArticlesList.tsx": "Displays a list of up to 10 news articles with title, source, date, content preview, and sentiment badge. Shows loading skeletons or empty state when appropriate.",
  "frontend/src/components/NewsSentimentBadge.tsx": "Badge component that displays sentiment (Positive/Negative/Neutral) based on a numeric score with color-coded styling.",
  "frontend/src/components/PredictionCard.tsx": "Card displaying stock prediction details including movement direction (bullish/bearish/neutral) with icon, confidence level progress bar, prediction score, and timestamp.",
  "frontend/src/components/StockPriceChart.tsx": "Line chart component using Recharts to visualize prediction scores over time with pattern annotations and interactive tooltips showing confidence and detected patterns.",
  "frontend/src/components/StockSearchBar.tsx": "Search input with autocomplete dropdown for stock symbols, handles form submission and suggestion selection with keyboard navigation support.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching stock predictions, news articles, and historical data from the backend actor with proper dependency management.",
  "frontend/src/hooks/useStockAutocomplete.ts": "Provides a custom hook for stock symbol autocomplete with a hardcoded list of NSE stocks across banking, IT, energy, automobiles, pharmaceuticals, FMCG, metals, and other sectors.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes, financial-specific colors (bullish/bearish/neutral/warning), chart colors, and typography utilities for financial data display.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section featuring stock search bar and four feature cards highlighting news sentiment, FII/DII tracking, chart patterns, and AI predictions.",
  "frontend/src/pages/PredictionResultsPage.tsx": "Displays detailed stock prediction results including prediction card, contributing factors, FII/DII chart, price chart with patterns, and related news articles for a given stock symbol.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom colors using OKLCH color space, financial-specific color tokens, custom border radius, font families, and animation keyframes.",
  "project_state.json": "Project state file for a stock predictor AI website that aggregates data from NSE India, Moneycontrol, Economic Times, and news sources to predict stock movements using sentiment analysis, FII/DII data, and chart patterns. Currently has issues with prediction data not loading correctly and missing stocks in search autocomplete."
}