{
  "backend/main.mo": "Main Motoko actor implementing stock prediction storage with three maps (predictionsStore, newsArticlesStore, predictionData), HTTP outcall integration for fetching news from NewsAPI, and validation logic for stock symbols including format checks and duplicate prevention.",
  "backend/migration.mo": "Migration module defining OldActor and NewActor types with stock prediction and news article data structures, providing a run function that resets predictionData to an empty map during upgrades.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: NSE stock autocomplete verification and error handling/validation for stock addition workflow, with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 15 frontend files covering routing, UI components (search, prediction cards, charts), custom hooks for queries and autocomplete with 110+ NSE stocks, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode variables for financial UI including bullish/bearish colors, chart colors, and sidebar theming.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'Stock Market Predictor' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with home and prediction routes, QueryClient with 5-minute stale time, and Sonner toast notifications.",
  "frontend/src/components/ContributingFactorsSection.tsx": "Card component displaying three analysis factors (news sentiment, FII/DII institutional flow, chart patterns) with progress bars, color-coded indicators, and normalized percentage calculations.",
  "frontend/src/components/FiiDiiChart.tsx": "Recharts line chart visualizing FII and DII net investment flows over the last 30 data points with tooltips showing buy/sell volumes and date formatting.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing sticky header with TrendingUp icon and branding, main content outlet, and footer with disclaimer and caffeine.ai attribution link.",
  "frontend/src/components/NewsArticlesList.tsx": "Displays a list of news articles with title, source, date, and content preview, showing up to 10 most recent articles with loading skeletons and empty state handling.",
  "frontend/src/components/NewsSentimentBadge.tsx": "Renders a colored badge indicating sentiment (Positive/Negative/Neutral) based on a numeric score threshold, using custom color classes for bullish, bearish, and neutral states.",
  "frontend/src/components/PredictionCard.tsx": "Displays stock prediction details including movement direction (bullish/bearish/neutral) with icons, confidence level as a progress bar, prediction score, and timestamp in a card layout.",
  "frontend/src/components/StockPriceChart.tsx": "Renders a line chart showing prediction scores over time using Recharts, with annotations for detected chart patterns and interactive tooltips displaying score, confidence, and pattern details.",
  "frontend/src/components/StockSearchBar.tsx": "Provides a search input with autocomplete suggestions for stock symbols, validates input format (length, characters, no leading numbers), and handles search submission with error display.",
  "frontend/src/hooks/useActor.ts": "Custom React Query hook that creates and manages an authenticated or anonymous actor instance based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using AuthClient with configurable options and delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching stock predictions, news articles, and historical data from the backend actor, plus a mutation hook to add new stock predictions with mock data generation.",
  "frontend/src/hooks/useStockAutocomplete.ts": "Provides a stock autocomplete hook with a hardcoded list of NSE stocks across various sectors (banking, IT, energy, automobiles, pharma, FMCG, metals) for search functionality.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes, financial-specific colors (bullish/bearish/neutral), chart colors, and utility classes for financial data display.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section featuring stock search bar and four feature cards highlighting news sentiment, FII/DII tracking, chart patterns, and AI predictions.",
  "frontend/src/pages/PredictionResultsPage.tsx": "Displays detailed stock prediction results including prediction card, contributing factors, news articles, FII/DII chart, and price chart; auto-generates prediction if not found and handles loading/error states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme settings including typography, container queries, animations, custom fonts (Inter, JetBrains Mono), and design tokens for a financial/trading UI with bullish/bearish/chart colors.",
  "project_state.json": "Project state metadata for a Stock Market Predictor application tracking a known issue where stocks cannot be added to the system, with pending feature requests to fix backend stock persistence logic and improve frontend stock search autocomplete."
}