{
  "kind": "build_request",
  "title": "Fix stock addition functionality",
  "projectName": "Stock Market Predictor",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and fix the backend logic that prevents new stocks from being added to the system. Ensure the storePrediction method in backend/main.mo properly persists new stock predictions to the predictionData HashMap.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "more stocks are not added please check once"
        ]
      },
      "acceptanceCriteria": [
        "New stock predictions can be successfully stored via the storePrediction method",
        "Stored predictions are retrievable through getPredictionsBySymbol",
        "The predictionData HashMap correctly maintains entries for all added stocks"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Verify that the frontend stock search autocomplete in useStockAutocomplete.ts includes all necessary NSE stocks and that new stocks can be searched for after being added to the backend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "more stocks are not added"
        ]
      },
      "acceptanceCriteria": [
        "The autocomplete list contains a comprehensive set of NSE stocks",
        "Users can successfully search for and select stocks from the autocomplete",
        "The search functionality works correctly with newly added stocks"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add proper error handling and logging to the stock addition workflow so that failures are visible and diagnosable. Include validation for stock symbol format and duplicate prevention.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-recent"
        ]
      },
      "acceptanceCriteria": [
        "Error messages are displayed to users when stock addition fails",
        "Backend logs capture failed addition attempts with details",
        "Duplicate stock symbols are handled gracefully with appropriate feedback"
      ]
    }
  ],
  "constraints": [
    "Maintain the single-actor architecture in backend/main.mo",
    "Preserve the existing predictionData HashMap structure",
    "Do not modify immutable frontend paths including useInternetIdentity.ts and UI components"
  ],
  "nonGoals": [
    "Adding new stock data sources beyond existing ones",
    "Implementing bulk stock import functionality",
    "Changing the overall application architecture"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}